; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	instrument3 - instrument
	instrument4 - instrument
	satellite2 - satellite
	instrument5 - instrument
	instrument6 - instrument
	satellite3 - satellite
	instrument7 - instrument
	instrument8 - instrument
	instrument9 - instrument
	instrument10 - instrument
	instrument11 - instrument
	satellite4 - satellite
	instrument12 - instrument
	spectrograph1 - mode
	thermograph5 - mode
	spectrograph2 - mode
	image4 - mode
	infrared3 - mode
	image0 - mode
	groundstation4 - direction
	star2 - direction
	star5 - direction
	groundstation1 - direction
	groundstation11 - direction
	groundstation3 - direction
	groundstation12 - direction
	groundstation10 - direction
	star9 - direction
	star6 - direction
	groundstation0 - direction
	groundstation8 - direction
	star7 - direction
	phenomenon13 - direction
	star14 - direction
	phenomenon15 - direction
	star16 - direction
	star17 - direction
	planet18 - direction
	star19 - direction
	star20 - direction
	planet21 - direction
	phenomenon22 - direction
	planet23 - direction
	phenomenon24 - direction
	phenomenon25 - direction
	planet26 - direction
	planet27 - direction
	star28 - direction
	star29 - direction
	planet30 - direction
	planet31 - direction
	star32 - direction
	star33 - direction
	phenomenon34 - direction
	phenomenon35 - direction
)
(:init
	(supports instrument0 thermograph5)
	(supports instrument0 infrared3)
	(calibration_target instrument0 groundstation1)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 planet18)
	(supports instrument1 thermograph5)
	(calibration_target instrument1 star2)
	(calibration_target instrument1 groundstation0)
	(supports instrument2 thermograph5)
	(supports instrument2 infrared3)
	(calibration_target instrument2 groundstation1)
	(supports instrument3 image0)
	(calibration_target instrument3 groundstation8)
	(supports instrument4 infrared3)
	(supports instrument4 image4)
	(calibration_target instrument4 groundstation0)
	(calibration_target instrument4 star6)
	(calibration_target instrument4 groundstation10)
	(calibration_target instrument4 star9)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 planet31)
	(supports instrument5 image4)
	(calibration_target instrument5 star5)
	(supports instrument6 thermograph5)
	(supports instrument6 spectrograph1)
	(supports instrument6 infrared3)
	(calibration_target instrument6 groundstation1)
	(calibration_target instrument6 groundstation11)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(power_avail satellite2)
	(pointing satellite2 groundstation1)
	(supports instrument7 infrared3)
	(supports instrument7 thermograph5)
	(supports instrument7 spectrograph1)
	(calibration_target instrument7 groundstation11)
	(supports instrument8 infrared3)
	(supports instrument8 image0)
	(supports instrument8 spectrograph2)
	(calibration_target instrument8 groundstation10)
	(calibration_target instrument8 star7)
	(calibration_target instrument8 groundstation8)
	(supports instrument9 image4)
	(calibration_target instrument9 star6)
	(calibration_target instrument9 groundstation12)
	(calibration_target instrument9 groundstation3)
	(calibration_target instrument9 star7)
	(supports instrument10 spectrograph2)
	(calibration_target instrument10 groundstation10)
	(supports instrument11 image4)
	(calibration_target instrument11 star9)
	(on_board instrument7 satellite3)
	(on_board instrument8 satellite3)
	(on_board instrument9 satellite3)
	(on_board instrument10 satellite3)
	(on_board instrument11 satellite3)
	(power_avail satellite3)
	(pointing satellite3 star33)
	(supports instrument12 image0)
	(supports instrument12 infrared3)
	(calibration_target instrument12 star7)
	(calibration_target instrument12 groundstation8)
	(calibration_target instrument12 groundstation0)
	(calibration_target instrument12 star6)
	(on_board instrument12 satellite4)
	(power_avail satellite4)
	(pointing satellite4 groundstation8)
)
(:goal (and
	(pointing satellite3 planet30)
	(pointing satellite4 planet30)
	(have_image star14 image4)
	(have_image star16 thermograph5)
	(have_image star17 thermograph5)
	(have_image planet18 spectrograph2)
	(have_image planet18 image4)
	(have_image star19 image4)
	(have_image star19 spectrograph2)
	(have_image star20 thermograph5)
	(have_image star20 infrared3)
	(have_image planet21 thermograph5)
	(have_image phenomenon22 thermograph5)
	(have_image phenomenon22 spectrograph2)
	(have_image planet23 spectrograph2)
	(have_image phenomenon25 infrared3)
	(have_image planet26 infrared3)
	(have_image planet26 spectrograph2)
	(have_image planet27 thermograph5)
	(have_image star28 thermograph5)
	(have_image star29 image0)
	(have_image planet30 spectrograph2)
	(have_image planet30 image0)
	(have_image planet31 spectrograph2)
	(have_image planet31 image4)
	(have_image star32 spectrograph1)
	(have_image star32 thermograph5)
	(have_image star33 image0)
	(have_image star33 spectrograph1)
	(have_image phenomenon34 image0)
	(have_image phenomenon34 infrared3)
	(have_image phenomenon35 image0)
	(have_image phenomenon35 spectrograph2)
))
(:metric minimize (total-time))

)

; plan
1. (turn_to satellite3 planet30 star33)
   deleted: (pointing satellite3 star33)
   added: (pointing satellite3 planet30)
   goals met: 1 of 33
2. (turn_to satellite4 planet30 groundstation8)
   deleted: (pointing satellite4 groundstation8)
   added: (pointing satellite4 planet30)
   goals met: 2 of 33
3. (switch_on instrument8 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument8)
   goals met: 2 of 33
4. (turn_to satellite3 star7 planet30)
   deleted: (pointing satellite3 planet30)
   added: (pointing satellite3 star7)
   goals met: 1 of 33
5. (switch_on instrument6 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument6)
   goals met: 1 of 33
6. (switch_on instrument4 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument4)
   goals met: 1 of 33
7. (calibrate satellite2 instrument6 groundstation1)
   added: (calibrated instrument6)
   goals met: 1 of 33
8. (turn_to satellite2 phenomenon22 groundstation1)
   deleted: (pointing satellite2 groundstation1)
   added: (pointing satellite2 phenomenon22)
   goals met: 1 of 33
9. (calibrate satellite3 instrument8 star7)
   added: (calibrated instrument8)
   goals met: 1 of 33
10. (turn_to satellite3 planet30 star7)
   deleted: (pointing satellite3 star7)
   added: (pointing satellite3 planet30)
   goals met: 2 of 33
11. (turn_to satellite1 star6 planet31)
   deleted: (pointing satellite1 planet31)
   added: (pointing satellite1 star6)
   goals met: 2 of 33
12. (take_image satellite2 phenomenon22 instrument6 thermograph5)
   added: (have_image phenomenon22 thermograph5)
   goals met: 3 of 33
13. (calibrate satellite1 instrument4 star6)
   added: (calibrated instrument4)
   goals met: 3 of 33
14. (turn_to satellite1 phenomenon25 star6)
   deleted: (pointing satellite1 star6)
   added: (pointing satellite1 phenomenon25)
   goals met: 3 of 33
15. (turn_to satellite2 planet21 phenomenon22)
   deleted: (pointing satellite2 phenomenon22)
   added: (pointing satellite2 planet21)
   goals met: 3 of 33
16. (take_image satellite1 phenomenon25 instrument4 infrared3)
   added: (have_image phenomenon25 infrared3)
   goals met: 4 of 33
17. (take_image satellite3 planet30 instrument8 image0)
   added: (have_image planet30 image0)
   goals met: 5 of 33
18. (take_image satellite3 planet30 instrument8 spectrograph2)
   added: (have_image planet30 spectrograph2)
   goals met: 6 of 33
19. (take_image satellite2 planet21 instrument6 thermograph5)
   added: (have_image planet21 thermograph5)
   goals met: 7 of 33
20. (turn_to satellite3 phenomenon34 planet30)
   deleted: (pointing satellite3 planet30)
   added: (pointing satellite3 phenomenon34)
   goals met: 6 of 33
21. (turn_to satellite1 planet18 phenomenon25)
   deleted: (pointing satellite1 phenomenon25)
   added: (pointing satellite1 planet18)
   goals met: 6 of 33
22. (turn_to satellite2 planet26 planet21)
   deleted: (pointing satellite2 planet21)
   added: (pointing satellite2 planet26)
   goals met: 6 of 33
23. (take_image satellite3 phenomenon34 instrument8 image0)
   added: (have_image phenomenon34 image0)
   goals met: 7 of 33
24. (take_image satellite3 phenomenon34 instrument8 infrared3)
   added: (have_image phenomenon34 infrared3)
   goals met: 8 of 33
25. (take_image satellite1 planet18 instrument4 image4)
   added: (have_image planet18 image4)
   goals met: 9 of 33
26. (turn_to satellite3 planet30 phenomenon34)
   deleted: (pointing satellite3 phenomenon34)
   added: (pointing satellite3 planet30)
   goals met: 10 of 33
27. (take_image satellite2 planet26 instrument6 infrared3)
   added: (have_image planet26 infrared3)
   goals met: 11 of 33
28. (turn_to satellite3 phenomenon22 planet30)
   deleted: (pointing satellite3 planet30)
   added: (pointing satellite3 phenomenon22)
   goals met: 10 of 33
29. (turn_to satellite1 planet31 planet18)
   deleted: (pointing satellite1 planet18)
   added: (pointing satellite1 planet31)
   goals met: 10 of 33
30. (take_image satellite3 phenomenon22 instrument8 spectrograph2)
   added: (have_image phenomenon22 spectrograph2)
   goals met: 11 of 33
31. (take_image satellite1 planet31 instrument4 image4)
   added: (have_image planet31 image4)
   goals met: 12 of 33
32. (turn_to satellite2 planet27 planet26)
   deleted: (pointing satellite2 planet26)
   added: (pointing satellite2 planet27)
   goals met: 12 of 33
33. (take_image satellite2 planet27 instrument6 thermograph5)
   added: (have_image planet27 thermograph5)
   goals met: 13 of 33
34. (turn_to satellite3 planet30 phenomenon22)
   deleted: (pointing satellite3 phenomenon22)
   added: (pointing satellite3 planet30)
   goals met: 14 of 33
35. (turn_to satellite3 phenomenon35 planet30)
   deleted: (pointing satellite3 planet30)
   added: (pointing satellite3 phenomenon35)
   goals met: 13 of 33
36. (turn_to satellite1 star14 planet31)
   deleted: (pointing satellite1 planet31)
   added: (pointing satellite1 star14)
   goals met: 13 of 33
37. (turn_to satellite2 star16 planet27)
   deleted: (pointing satellite2 planet27)
   added: (pointing satellite2 star16)
   goals met: 13 of 33
38. (take_image satellite3 phenomenon35 instrument8 image0)
   added: (have_image phenomenon35 image0)
   goals met: 14 of 33
39. (take_image satellite3 phenomenon35 instrument8 spectrograph2)
   added: (have_image phenomenon35 spectrograph2)
   goals met: 15 of 33
40. (take_image satellite1 star14 instrument4 image4)
   added: (have_image star14 image4)
   goals met: 16 of 33
41. (take_image satellite2 star16 instrument6 thermograph5)
   added: (have_image star16 thermograph5)
   goals met: 17 of 33
42. (turn_to satellite3 planet30 phenomenon35)
   deleted: (pointing satellite3 phenomenon35)
   added: (pointing satellite3 planet30)
   goals met: 18 of 33
43. (turn_to satellite1 star19 star14)
   deleted: (pointing satellite1 star14)
   added: (pointing satellite1 star19)
   goals met: 18 of 33
44. (turn_to satellite2 star17 star16)
   deleted: (pointing satellite2 star16)
   added: (pointing satellite2 star17)
   goals met: 18 of 33
45. (take_image satellite1 star19 instrument4 image4)
   added: (have_image star19 image4)
   goals met: 19 of 33
46. (turn_to satellite3 planet18 planet30)
   deleted: (pointing satellite3 planet30)
   added: (pointing satellite3 planet18)
   goals met: 18 of 33
47. (take_image satellite2 star17 instrument6 thermograph5)
   added: (have_image star17 thermograph5)
   goals met: 19 of 33
48. (take_image satellite3 planet18 instrument8 spectrograph2)
   added: (have_image planet18 spectrograph2)
   goals met: 20 of 33
49. (turn_to satellite1 star20 star19)
   deleted: (pointing satellite1 star19)
   added: (pointing satellite1 star20)
   goals met: 20 of 33
50. (turn_to satellite3 planet30 planet18)
   deleted: (pointing satellite3 planet18)
   added: (pointing satellite3 planet30)
   goals met: 21 of 33
51. (turn_to satellite2 star20 star17)
   deleted: (pointing satellite2 star17)
   added: (pointing satellite2 star20)
   goals met: 21 of 33
52. (take_image satellite1 star20 instrument4 infrared3)
   added: (have_image star20 infrared3)
   goals met: 22 of 33
53. (take_image satellite2 star20 instrument6 thermograph5)
   added: (have_image star20 thermograph5)
   goals met: 23 of 33
54. (turn_to satellite3 planet23 planet30)
   deleted: (pointing satellite3 planet30)
   added: (pointing satellite3 planet23)
   goals met: 22 of 33
55. (take_image satellite3 planet23 instrument8 spectrograph2)
   added: (have_image planet23 spectrograph2)
   goals met: 23 of 33
56. (turn_to satellite2 star28 star20)
   deleted: (pointing satellite2 star20)
   added: (pointing satellite2 star28)
   goals met: 23 of 33
57. (turn_to satellite3 planet30 planet23)
   deleted: (pointing satellite3 planet23)
   added: (pointing satellite3 planet30)
   goals met: 24 of 33
58. (take_image satellite2 star28 instrument6 thermograph5)
   added: (have_image star28 thermograph5)
   goals met: 25 of 33
59. (turn_to satellite2 star32 star28)
   deleted: (pointing satellite2 star28)
   added: (pointing satellite2 star32)
   goals met: 25 of 33
60. (take_image satellite2 star32 instrument6 spectrograph1)
   added: (have_image star32 spectrograph1)
   goals met: 26 of 33
61. (turn_to satellite3 planet26 planet30)
   deleted: (pointing satellite3 planet30)
   added: (pointing satellite3 planet26)
   goals met: 25 of 33
62. (take_image satellite3 planet26 instrument8 spectrograph2)
   added: (have_image planet26 spectrograph2)
   goals met: 26 of 33
63. (turn_to satellite3 planet30 planet26)
   deleted: (pointing satellite3 planet26)
   added: (pointing satellite3 planet30)
   goals met: 27 of 33
64. (take_image satellite2 star32 instrument6 thermograph5)
   added: (have_image star32 thermograph5)
   goals met: 28 of 33
65. (turn_to satellite2 star33 star32)
   deleted: (pointing satellite2 star32)
   added: (pointing satellite2 star33)
   goals met: 28 of 33
66. (turn_to satellite3 star33 planet30)
   deleted: (pointing satellite3 planet30)
   added: (pointing satellite3 star33)
   goals met: 27 of 33
67. (take_image satellite2 star33 instrument6 spectrograph1)
   added: (have_image star33 spectrograph1)
   goals met: 28 of 33
68. (turn_to satellite3 planet31 star33)
   deleted: (pointing satellite3 star33)
   added: (pointing satellite3 planet31)
   goals met: 28 of 33
69. (take_image satellite3 planet31 instrument8 spectrograph2)
   added: (have_image planet31 spectrograph2)
   goals met: 29 of 33
70. (turn_to satellite3 star19 planet31)
   deleted: (pointing satellite3 planet31)
   added: (pointing satellite3 star19)
   goals met: 29 of 33
71. (take_image satellite3 star19 instrument8 spectrograph2)
   added: (have_image star19 spectrograph2)
   goals met: 30 of 33
72. (turn_to satellite3 star29 star19)
   deleted: (pointing satellite3 star19)
   added: (pointing satellite3 star29)
   goals met: 30 of 33
73. (take_image satellite3 star29 instrument8 image0)
   added: (have_image star29 image0)
   goals met: 31 of 33
74. (turn_to satellite3 star33 star29)
   deleted: (pointing satellite3 star29)
   added: (pointing satellite3 star33)
   goals met: 31 of 33
75. (take_image satellite3 star33 instrument8 image0)
   added: (have_image star33 image0)
   goals met: 32 of 33
76. (turn_to satellite3 planet30 star33)
   deleted: (pointing satellite3 star33)
   added: (pointing satellite3 planet30)
   goals met: 33 of 33
